{
    "modelTopology": {
        "class_name": "Sequential",
        "config": [{
            "class_name": "LSTM",
            "config": {
                "units": 32,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1,
                        "mode": "fan_avg",
                        "distribution": "normal",
                        "seed": null
                    }
                },
                "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                        "gain": 1,
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "unit_forget_bias": null,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0,
                "recurrent_dropout": 0,
                "implementation": null,
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": true,
                "unroll": false,
                "name": "lstm_LSTM1",
                "trainable": false,
                "batch_input_shape": [1, 10, 5],
                "dtype": "float32"
            }
        }, {
            "class_name": "Dropout",
            "config": {
                "rate": null,
                "noise_shape": null,
                "seed": null,
                "name": "dropout_Dropout1",
                "trainable": true
            }
        }, {
            "class_name": "Dense",
            "config": {
                "units": 2,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1,
                        "mode": "fan_avg",
                        "distribution": "normal",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null,
                "name": "dense_Dense1",
                "trainable": true
            }
        }],
        "keras_version": "tfjs-layers 1.0.0",
        "backend": "tensor_flow.js"
    },
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v1.0.0",
    "convertedBy": null,
    "weightsManifest": [{
        "paths":["showcases/shopping_case/finalweights.bin"],
        "weights": [{
            "name": "lstm_LSTM1/kernel",
            "shape": [5, 128],
            "dtype": "float32"
        }, {
            "name": "lstm_LSTM1/recurrent_kernel",
            "shape": [32, 128],
            "dtype": "float32"
        }, {
            "name": "lstm_LSTM1/bias",
            "shape": [128],
            "dtype": "float32"
        }, {
            "name": "dense_Dense1/kernel",
            "shape": [32, 2],
            "dtype": "float32"
        }, {
            "name": "dense_Dense1/bias",
            "shape": [2],
            "dtype": "float32"
        }]
    }]
}